# Getting started with pandas

In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

### Important: Difference between numpy and pandas indexing

In numpy, a[1] -> this is the row index.


In pandas, a[1] -> this is the column index

## Introduction to pandas data structures

### Series - Analogous to Vector in R

In [9]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [10]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [11]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2['a']

-5

In [ ]:
# Series is as a fixed-length, ordered dict, 
# as it is a mapping of index values to data values

'b' in obj2

In [3]:
# Should you have data contained in a Python dict, 
# you can create a Series from it by passing the dict.
# Note however, if you create a DataFrame with a single column as in this case, it will throw an Value error:
# ValueError: If using all scalar values, you must pass an index

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [242]:
pd.DataFrame(sdata)   
# ValueError: If using all scalar values, you must pass an index

ValueError: If using all scalar values, you must pass an index

In [12]:
pd.Series(sdata)     # This will work as there is only column.

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [13]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [7]:
pd.isnull(obj4)
# obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [6]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [14]:
# A Series’s index can be altered in place by assignment
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

#### Quick way to create DataFrame from list of random 16 numbers

In [17]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),              
                index=['row'+str(t) for t in range(4)],
                columns=['col'+str(t) for t in range(4)])

data

      col0  col1  col2  col3
row0     0     1     2     3
row1     4     5     6     7
row2     8     9    10    11
row3    12    13    14    15

#### Creating DataFrame from a dictionary

In [15]:
data = {'first': np.random.random(5),
        'second': np.random.randint(0,10,5),
        'third': np.random.randn(5)}
frame = DataFrame(data)
frame

      first  second     third
0  0.085018       3  0.658963
1  0.045113       1  0.563975
2  0.979620       1 -0.251183
3  0.160008       6  0.434644
4  0.791965       1 -1.020984

#### Let us do some operations on DataFrame

In [63]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [64]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [65]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [66]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [67]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [68]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [69]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

#### Adding new column -- this is useful when you would want to add an intercept column in linear regresion.

In [70]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [73]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [75]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [76]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [77]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [78]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [79]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

### Index objects

In [86]:
# pandas’s Index objects are responsible for holding the axis labels and other metadata
# (like the axis name or names)

obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [87]:
index[1:]

Index(['b', 'c'], dtype='object')

In [88]:
# Index objects are immutable and thus can’t be modified by the user:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [89]:
# Immutability is important so that Index objects can be safely shared among data structures
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

## Essential functionality

### Reindexing

In [72]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [73]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [74]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [75]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

### Dropping entries from an axis

In [103]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [104]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [105]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [106]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [107]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [108]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

#### Series

In [18]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [19]:
obj[1]      # Since this is like list, position index would work normally

1.0

In [112]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [79]:
obj[['b', 'a', 'd']]   # Since this is like list, label index would work normally

b    7.2
a   -5.3
d    4.5
dtype: float64

In [114]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [115]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [116]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [117]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

#### DataFrame

In [39]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### When a value is provided in the square bracket, it checks for the column names. If it finds it gives the value, else throws KeyError

In [40]:
data['two']    # In this formatting of selection, only column names can be given.

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [ ]:
# This wont work
data[0]     # KeyError  --> This is trying to search in the column list

In [ ]:
data[['three', 'one']]   # This works, this is column slicing of 2 columns

#### Important: When slice is provided, it slices rows and not columns

In [41]:
data[0:3]   # This slices on rows and not on columns.

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [42]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

### IMPORTANT: Difference between loc and iloc

**loc -> Label based indexing**

**iloc -> Index location i.e. positional indexing **

In [46]:
data.loc['Ohio'] # have to pass on the index values or column names only and not the position else it will throw TypeError

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

In [ ]:
data.loc[: ,0]     # Trying to retrieve the first column
#or
data.loc[0]     # Trying to retrieve the first row
# TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [0] of <class 'int'>

In [51]:
data.loc[:'Utah', ['one','two']]  # When you use loc, use can only mention the column names and/or index values

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9

In [52]:
data.iloc[0:3, 1:3]  # First 3 rows and 2 columns -> based on position index
# No column names or index values should be provided, else error

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10

In [ ]:
data.iloc['Utah']         # Type Error
# OR
data.iloc[0:3, 'one']      # Type Error

# TypeError: cannot do positional indexing on 
#<class 'pandas.core.indexes.base.Index'> with these indexers [Utah] of <class 'str'>

#### Important: Then, how to use labels and position together i.e. loc and iloc together

First slice on rows/columns, which is then sliced columns/rows.

In [61]:
# First 3 rows by position and first 2 columns by name/label
data.iloc[0:3].loc[: , ['one','two']]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9

In [65]:
# First 2 rows by names/labels and first 3 columns by position
data.loc[['Ohio','Colorado']].iloc[:, 0:3]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6

#### Slicing using logical indices

In [26]:
data[data['three'] > 5]    # Logical vector as input, works as expected

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [28]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data[data.three > 5].iloc[:, :3]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

#### Operations between DataFrame and Series

In [143]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [144]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [145]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [80]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), 
                  columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [81]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [82]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

### Function application and mapping

In [153]:
frame = DataFrame(np.random.randn(4, 3), 
                  columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [154]:
frame

               b         d         e
Utah   -1.549953  0.334959 -0.345888
Ohio   -0.481962  0.922487 -0.106064
Texas  -0.958356  1.289155  0.743939
Oregon  0.856410 -0.086584 -0.684224

In [155]:
np.abs(frame)

               b         d         e
Utah    1.549953  0.334959  0.345888
Ohio    0.481962  0.922487  0.106064
Texas   0.958356  1.289155  0.743939
Oregon  0.856410  0.086584  0.684224

In [156]:
f = lambda x: x.max() - x.min()

In [157]:
# Column-wise operation -> Finding column wise range.
frame.apply(f)

b    2.406363
d    1.375739
e    1.428162
dtype: float64

In [158]:
# Row-wise operation -> Finding row-wise range.

frame.apply(f, axis=1)

Utah      1.884913
Ohio      1.404448
Texas     2.247511
Oregon    1.540633
dtype: float64

In [159]:
# The function passed to apply need not return a scalar value, 
# it can also return a Series with multiple values.

def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -1.549953 -0.086584 -0.684224
max  0.856410  1.289155  0.743939

In [160]:
# Element-wise operation.
# Suppose you wanted to compute a formatted string from each floating point value in frame.

format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    -1.55   0.33  -0.35
Ohio    -0.48   0.92  -0.11
Texas   -0.96   1.29   0.74
Oregon   0.86  -0.09  -0.68

In [162]:
# The reason for the name "applymap" is that 
# Series has a map method for applying an element-wise function:

frame['e'].map(format)

Utah      -0.35
Ohio      -0.11
Texas      0.74
Oregon    -0.68
Name: e, dtype: object

### Sorting and ranking

In [163]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [164]:
# With a DataFrame, you can sort by index on either axis:

frame = DataFrame(np.arange(8).reshape((2, 4)), 
                  index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [165]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [166]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [233]:
# To sort a Series by its values

obj = Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [234]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()  # Any missing values are sorted to the end of the Series by default.

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [87]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [88]:
# On DataFrame, you may want to sort by the values in one or more columns. To do so,
# pass one or more column names to the "by" option.

frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [89]:
# To sort by multiple columns, pass a list of names:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

#### Ranking

In [238]:
# Ranking a series
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()   # by default rank breaks ties by assigning each group the mean rank

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [239]:
# Ranking based on ascending order and in event of clash, 
# Assign ranks in the order the values appear in the data

obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [176]:
# Ranking based on descending order and in event of clash, 
# Use the maximum rank for the whole group

obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [177]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [178]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

## Summarizing and computing descriptive statistics

In [187]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [188]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [189]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [190]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [191]:
# Returns the index of the axis (in this case -> it is column) which has the max value.
# Equivalent to argmax 
df.idxmax()

one    b
two    d
dtype: object

In [192]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [193]:
# Similar to summary function in R.
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [194]:
# On non-numeric data, describe produces alternate summary statistics:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and covariance

In [ ]:
import pandas.io.data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.iteritems()})

print price
print volume

In [128]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2015-07-06 -0.003480 -0.001032 -0.002181 -0.000225
2015-07-07 -0.002460  0.004131  0.001639 -0.002027
2015-07-08 -0.024823 -0.015599 -0.011151 -0.001354
2015-07-09 -0.020397  0.007449  0.004229  0.006329
2015-07-10  0.026734  0.018149  0.018920  0.002022

In [129]:
returns.MSFT.corr(returns.IBM)

0.49915671815096074

In [130]:
returns.MSFT.cov(returns.IBM)

8.324937801475718e-05

In [131]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.321822  0.379703  0.347413
GOOG  0.321822  1.000000  0.368300  0.466679
IBM   0.379703  0.368300  1.000000  0.499157
MSFT  0.347413  0.466679  0.499157  1.000000

In [132]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000275  0.000057  0.000074  0.000082
GOOG  0.000057  0.000167  0.000053  0.000085
IBM   0.000074  0.000053  0.000136  0.000083
MSFT  0.000082  0.000085  0.000083  0.000204

In [133]:
returns.corrwith(returns.IBM)

AAPL    0.379703
GOOG    0.368300
IBM     1.000000
MSFT    0.499157
dtype: float64

In [134]:
returns.corrwith(volume)

# Passing axis=1 does things row-wise instead. In all cases, the data points are aligned by
# label before computing the correlation

AAPL   -0.091599
GOOG   -0.047299
IBM    -0.172611
MSFT   -0.095275
dtype: float64

### Unique values, value counts, and membership

In [195]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [196]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [197]:
# Find the frequency count of values.
# The Series is sorted by value in descending order as a convenience.

obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [198]:
pd.value_counts(obj.values, sort=False)

d    1
c    3
a    3
b    2
dtype: int64

In [199]:
# Similar to %in% in R.
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [200]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [90]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [91]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling missing data

In [203]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [204]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [205]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data

In [206]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [207]:
# Naturally, you could have computed this yourself by boolean indexing:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [208]:
# You may want to drop rows or columns which are all NA or just those containing any NAs:
# ropna by default drops any row containing a missing value.

data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [209]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [210]:
# Passing how='all' will only drop rows that are all NA:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [211]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [212]:
# Dropping columns in the same way is only a matter of passing axis=1:

data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [214]:
df = DataFrame(np.random.randn(7, 3))
df.loc[:4, 1] = NA; 
df.loc[:2, 2] = NA
df

          0         1         2
0 -0.075742       NaN       NaN
1  0.480278       NaN       NaN
2  0.278584       NaN       NaN
3  0.366404       NaN -0.560030
4 -1.936531       NaN  1.571286
5 -0.209627  2.244407  1.990102
6 -0.832289 -1.888942  0.747483

In [215]:
df.dropna(thresh=3)

          0         1         2
5 -0.209627  2.244407  1.990102
6 -0.832289 -1.888942  0.747483

### Filling in missing data

In [216]:
df.fillna(0)

          0         1         2
0 -0.075742  0.000000  0.000000
1  0.480278  0.000000  0.000000
2  0.278584  0.000000  0.000000
3  0.366404  0.000000 -0.560030
4 -1.936531  0.000000  1.571286
5 -0.209627  2.244407  1.990102
6 -0.832289 -1.888942  0.747483

In [217]:
# Calling fillna with a dict you can use a different fill value for each column:

df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.075742  0.500000       NaN
1  0.480278  0.500000       NaN
2  0.278584  0.500000       NaN
3  0.366404  0.500000 -0.560030
4 -1.936531  0.500000  1.571286
5 -0.209627  2.244407  1.990102
6 -0.832289 -1.888942  0.747483

In [218]:
# fillna returns a new object, but you can modify the existing object in place
# always returns a reference to the filled object

_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.075742  0.000000  0.000000
1  0.480278  0.000000  0.000000
2  0.278584  0.000000  0.000000
3  0.366404  0.000000 -0.560030
4 -1.936531  0.000000  1.571286
5 -0.209627  2.244407  1.990102
6 -0.832289 -1.888942  0.747483

In [220]:
# The same interpolation methods available for reindexing can be used with fillna:

df = DataFrame(np.random.randn(6, 3))
df.loc[2:, 1] = NA; df.loc[4:, 2] = NA
df

          0         1         2
0 -1.142111 -0.079009 -0.397548
1  1.961893  0.363194  0.157493
2 -0.316790       NaN -1.891649
3  0.094631       NaN -0.186438
4  0.901230       NaN       NaN
5  0.101571       NaN       NaN

In [221]:
df.fillna(method='ffill')

          0         1         2
0 -1.142111 -0.079009 -0.397548
1  1.961893  0.363194  0.157493
2 -0.316790  0.363194 -1.891649
3  0.094631  0.363194 -0.186438
4  0.901230  0.363194 -0.186438
5  0.101571  0.363194 -0.186438

In [222]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.142111 -0.079009 -0.397548
1  1.961893  0.363194  0.157493
2 -0.316790  0.363194 -1.891649
3  0.094631  0.363194 -0.186438
4  0.901230       NaN -0.186438
5  0.101571       NaN -0.186438

In [223]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Other pandas topics

### Panel data

In [ ]:
import pandas.io.data as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk)) for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [ ]:
pdata

In [ ]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

In [ ]:
pdata.ix[:, '6/1/2012', :]

In [ ]:
pdata.ix['Adj Close', '5/22/2012':, :]

In [ ]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

In [ ]:
stacked.to_panel()